trade_exp/src/Reports/ОстаткиИДоступностьТоваров/ОстаткиИДоступностьТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="817c062c-8911-4d1b-9e65-4ac0a21db8df">
  <name>ОстаткиИДоступностьТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
</mdclass:Report>

trade_exp/src/InformationRegisters/НоменклатураСегмента/НоменклатураСегмента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>НоменклатураСегмента</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <dimensions>
    <name>Сегмент</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/AccumulationRegisters/ЗапасыИПотребности/ЗапасыИПотребности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="f8b7177a-e10e-497a-870e-8a0109117431">
  <name>ЗапасыИПотребности</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="2a3239b5-c939-45ab-a821-679e4fe02b0c">
    <name>ВНаличии</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="fa84dffb-fc50-40db-b9e9-2eecc08d3aff">
    <name>Поступит</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="fd2c8e08-d7c5-41b1-a555-e61c7ec66966">
    <name>Заказано</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="63b04ee8-431e-43e1-86d7-a31699fe5f9d">
    <name>РезервироватьНаСкладе</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="7db60568-8a3c-4c91-ad5b-f1c37f1dff6d">
    <name>РезервироватьПоМереПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="bdd58b52-8895-40cb-9462-86ee07c1a418">
    <name>ОтложитьРезервирование</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="4256427c-6117-4032-b24a-fe3fe80b3479">
    <name>КОбеспечению</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="6ed35275-b9d3-4183-ac57-ab470c9070ce">
    <name>НеОбеспечивать</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes extendedConfigurationObject="f01cba2a-6eee-4608-be77-4081299421fb">
    <name>ЗакрытьГрафикПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="9fa49e04-61ac-4854-abc9-81a226d49748">
    <name>ЗакрытьГрафикОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="cc3a9a0c-ce39-4e09-95b3-5cf269ade3af">
    <name>ОтгружаемыйЗаказ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4de10a7f-26fe-4a6f-9977-b6f11b54f8a7">
    <name>ТипЗаписи</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ad05a33b-3278-43a0-ab32-a3fbf95febd2">
    <name>Сторно</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="52036866-218a-40f1-b620-3bf0ad8c374a">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="851d8e29-0692-4d7d-bb5f-869fa0f442e4">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="4d50d363-128e-4a9e-874f-dcd55a5764b3">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="795b0906-d397-48a6-a53a-d642ad9d07db">
    <name>Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="294f1bc8-ab72-47b2-ab6b-23004cf40406">
    <name>Заказ</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="6f8a11b2-8bda-4fd8-8728-ed5d380f935a">
    <name>ДатаСобытия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:AccumulationRegister>

trade_exp/src/InformationRegisters/РаспределениеЗапасов/РаспределениеЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="45342faa-1ece-480b-81d1-d8e80e853d58">
  <name>РаспределениеЗапасов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="9efb51da-7a4d-4d32-982b-58c144a21ccf">
    <name>РезервироватьПоМереПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="5482fa87-20f2-4a19-ab14-873fb7ea7b95">
    <name>КОбеспечениюБезРезерва</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="efa2f5bc-0e1c-4dde-b69d-6348f7626468">
    <name>ОтложитьРезервирование</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="0607377e-fee8-4608-9afb-b5a6f4e840ad">
    <name>Резервировать</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="7661a70e-8eb4-4d91-802a-616a1ac841bb">
    <name>НеОбеспечивать</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="3edada72-6355-41c9-a573-31af580e1078">
    <name>Зарезервировано</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="da36be43-5e81-4278-9f10-463495eba182">
    <name>Обеспечено</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="8144c0d0-6b3e-49b9-beb5-7d2291783cce">
    <name>НеОбеспечено</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="63380d67-a9d1-4dad-8840-41c7249204ab">
    <name>Запас</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="b1640808-e7c6-4807-936d-bd90cf45049d">
    <name>Свободно</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="1e4c922a-b382-44d6-9fd3-4680173f4a41">
    <name>Излишек</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="261e7ab2-2140-4288-a9b8-49b2ba6ae33a">
    <name>ВНаличии</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes extendedConfigurationObject="07d9b412-d603-469e-ab48-60c2bfa34bee">
    <name>РезервироватьПоМереПоступленияИтогНаДату</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="3b0831aa-fa4a-4ec4-a515-ac2d8dcc02ad">
    <name>НеОбеспеченоКОбеспечению</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <dimensions extendedConfigurationObject="2a3bab03-6376-456d-9d36-7b51914fe435">
    <name>Состояние</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="071db416-83a1-49bb-8727-0c50e9b7962d">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="908bbc1b-86a0-43c8-b40a-a1c31cf89ac3">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="7ebc9523-5df4-4dfc-ab70-41061e5b8b4f">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="aca20c25-c763-4dc8-909a-2cbf809a16f1">
    <name>Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="c3838a94-5f51-4ad4-832f-097e04916376">
    <name>ЗаказНаОтгрузку</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="f4169bf1-1ff0-488a-99aa-221a36f91319">
    <name>ЖелаемаяДатаОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="2e9cee72-6315-424e-b5e7-2820869c03f8">
    <name>ЗаказНаПоступление</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="ee2253b1-ab42-48e3-9904-a2aee6d27c4d">
    <name>ДатаПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="01679aa4-d527-4955-8909-4fd6d96702ac">
    <name>ТипЗаписиРаспределенияЗапасов</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/ABCКлассификацияНоменклатуры_Альтерра/ABCКлассификацияНоменклатуры_Альтерра.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ABCКлассификацияНоменклатуры_Альтерра</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Класс</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes extendedConfigurationObject="80d8f3a4-6b7b-4718-8ee3-b7242a527914">
    <name>Менеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Reports/ОстаткиИДоступностьТоваров/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Текст запроса должен быть добавлен к запросу, в котором существует ОтборПоСегментуНоменклатуры с полями Номенклатура, Характеристика, ИспользуетсяОтборПоСегментуНоменклатуры
// Если не передан чек УстановитьВручнуюТаблицуНоменклатуры, она будет создана типовым способом
//
// В этой функции ИспользуетсяОтборПоСегментуНоменклатуры = ИСТИНА и ПоказатьОбособленныеТовары = ЛОЖЬ, но это можно изменить, передав соответствующие флаги функции
// Параметр запроса ИспользуетсяОтборПоСегментуНоменклатуры устанавливается вызовом функции СегментыСервер.ВключитьОтборПоСегментуНоменклатурыВСКД,
// 		Она принимает Параметры:
//  		ОбъектНастройки 			- КомпоновщикНастроекКомпоновкиДанных, НастройкиВложенногоОбъектаКомпоновкиДанных - откуда брать настройки.
//  		ИспользоватьТолькоНастройки - Булево - признак того, что будут использованы настройки по умолчанию.
// Параметр запроса ПоказатьОбособленныеТовары устанавливается пользовательскими настройками
//
// Параметры:
//		НазваниеТаблицыОтстатков 					- Строка - название временной таблицы, в которую будут помещены остатки
//		УстановитьВручнуюТаблицуНоменклатуры		- Булево - признак того, что таблица Номенклатуры "ОтборПоСегментуНоменклатуры" уже задана в запросе, к которому добавляется текст
//		УстановитьВручнуюОтборПоСегменту 			- Булево - признак того, что ИспользуетсяОтборПоСегментуНоменклатуры будет установлен позже вручную
//		УстановитьВручнуюПоказОбособленныхТоваров 	- Булево - признак того, что ПоказатьОбособленныеТовары будет установлен позже вручную
//
// Возвращаемое значение:
//		Строка   - Текст запроса фактических остатков, выбранных во временную таблицу остатков с названием по умолчанию ЗапасыИПотребности с полями:
// 			- Номенклатура,
//			- Характеристика,
// 			- Склад,
// 			- Назначение,
//			- Заказ,
//			- ДатаСобытия,
//			- ВНаличииОстаток,
//			- ПоступитОстаток
//
Функция ПолучитьТекстЗапросаОстатков(НазваниеТаблицыОтстатков = "ЗапасыИПотребности", УстановитьВручнуюТаблицуНоменклатуры = Ложь, УстановитьВручнуюОтборПоСегменту = Ложь, УстановитьВручнуюПоказОбособленныхТоваров = Ложь) Экспорт
	
	ТекстТаблицаСегмент = "// Временная таблица отбора: ОтборПоСегментуНоменклатуры.
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Сегменты.Номенклатура КАК Номенклатура,
	|	Сегменты.Характеристика КАК Характеристика,
	|	ИСТИНА КАК ИспользуетсяОтборПоСегментуНоменклатуры
	|ПОМЕСТИТЬ ОтборПоСегментуНоменклатуры
	|ИЗ
	|	РегистрСведений.НоменклатураСегмента КАК Сегменты
	|{ГДЕ
	|	Сегменты.Сегмент.* КАК СегментНоменклатуры,
	|	Сегменты.Номенклатура.* КАК Номенклатура,
	|	Сегменты.Характеристика.* КАК Характеристика}
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика,
	|	ИспользуетсяОтборПоСегментуНоменклатуры
	|" + ОбщегоНазначенияУТ.РазделительЗапросовВПакете()
	+ "// Временная таблица отбора остатков: " + НазваниеТаблицыОтстатков + ".
	|";
	
	НачалоЗапроса = ?(Не УстановитьВручнуюТаблицуНоменклатуры, ТекстТаблицаСегмент, "// Временная таблица отбора остатков: " + НазваниеТаблицыОтстатков + ".
	|");
	
	Если ОбеспечениеВДокументахСервер.ЭтоПроизводительныйРежим() Тогда
		
		Текст =
			"ВЫБРАТЬ
			|	ИнформацияОДоступности.Номенклатура КАК Номенклатура,
			|	ИнформацияОДоступности.Характеристика КАК Характеристика,
			|	ИнформацияОДоступности.Склад КАК Склад,
			|	ИнформацияОДоступности.Назначение КАК Назначение,
			|	ИнформацияОДоступности.Заказ КАК Заказ,
			|	ИнформацияОДоступности.ДатаСобытия КАК ДатаСобытия,
			|	ИнформацияОДоступности.ВНаличииОстаток КАК ВНаличииОстаток,
			|	ИнформацияОДоступности.ПоступитОстаток КАК ПоступитОстаток
			|ПОМЕСТИТЬ " + НазваниеТаблицыОтстатков + "
			|ИЗ
			|	РегистрНакопления.ЗапасыИПотребности.Остатки(,
			|		Склад ССЫЛКА Справочник.Склады
			|			И ВЫБОР
			|				КОГДА &ПоказатьОбособленныеТовары
			|					ТОГДА
			|						ИСТИНА
			|				ИНАЧЕ Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
			|			КОНЕЦ
			|			{(Номенклатура, Характеристика) В(
			|				ВЫБРАТЬ
			|					ТаблицаОтбора.Номенклатура КАК Номенклатура,
			|					ТаблицаОтбора.Характеристика КАК Характеристика
			|				ИЗ
			|					ОтборПоСегментуНоменклатуры КАК ТаблицаОтбора
			|				ГДЕ
			|					ТаблицаОтбора.ИспользуетсяОтборПоСегментуНоменклатуры = &ИспользуетсяОтборПоСегментуНоменклатуры)}
			|			{Номенклатура.* КАК Номенклатура,
			|			Характеристика.* КАК Характеристика,
			|			Склад.* КАК Склад}) КАК ИнформацияОДоступности
			|";
		
	Иначе
		
		Текст =
			"ВЫБРАТЬ
			|	ИнформацияОДоступности.Номенклатура КАК Номенклатура,
			|	ИнформацияОДоступности.Характеристика КАК Характеристика,
			|	ИнформацияОДоступности.Склад КАК Склад,
			|	ИнформацияОДоступности.Назначение КАК Назначение,
			|	ИнформацияОДоступности.ЗаказНаПоступление КАК Заказ,
			|	ИнформацияОДоступности.ДатаПоступления КАК ДатаСобытия,
			|	ВЫБОР
			|		КОГДА ИнформацияОДоступности.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе)
			|			ТОГДА ИнформацияОДоступности.Запас
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК ВНаличииОстаток,
			|	ВЫБОР
			|		КОГДА ИнформацияОДоступности.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОжидаемоеПоступление)
			|			ТОГДА ИнформацияОДоступности.Запас
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК ПоступитОстаток
			|ПОМЕСТИТЬ " + НазваниеТаблицыОтстатков + "
			|ИЗ
			|	РегистрСведений.РаспределениеЗапасов КАК ИнформацияОДоступности
			|		{ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтборПоСегментуНоменклатуры КАК ТаблицаОтбора
			|		ПО ТаблицаОтбора.Номенклатура = ИнформацияОДоступности.Номенклатура
			|			И ТаблицаОтбора.Характеристика = ИнформацияОДоступности.Характеристика}
			|ГДЕ
			|	ИнформацияОДоступности.Состояние В (
			|		ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе),
			|		ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОжидаемоеПоступление))
			|	И ИнформацияОДоступности.Запас <> 0
			|	И ИнформацияОДоступности.Склад ССЫЛКА Справочник.Склады
			|	И ВЫБОР
			|			КОГДА &ПоказатьОбособленныеТовары ТОГДА
			|				ИСТИНА
			|			ИНАЧЕ
			|				ИнформацияОДоступности.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
			|		КОНЕЦ
			|{ГДЕ
			|	ТаблицаОтбора.ИспользуетсяОтборПоСегментуНоменклатуры = &ИспользуетсяОтборПоСегментуНоменклатуры
			|}
			|{ГДЕ
			|	ИнформацияОДоступности.Склад.* КАК Склад,
			|	ИнформацияОДоступности.Номенклатура.* КАК Номенклатура,
			|	ИнформацияОДоступности.Характеристика.* КАК Характеристика}
			|";
		
	КонецЕсли;
	
	ОкончаниеЗапроса = "ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура, Характеристика, Склад, Назначение";
	
	Текст = НачалоЗапроса + Текст + ОкончаниеЗапроса + ОбщегоНазначенияУТ.РазделительЗапросовВПакете();
	
	Если Не УстановитьВручнуюОтборПоСегменту Тогда
		Текст = СтрЗаменить(Текст, "&ИспользуетсяОтборПоСегментуНоменклатуры", "ИСТИНА");
	КонецЕсли;
	
	Если Не УстановитьВручнуюПоказОбособленныхТоваров Тогда
		Текст = СтрЗаменить(Текст, "&ПоказатьОбособленныеТовары", "ЛОЖЬ");
	КонецЕсли;
	
	Возврат Текст;

КонецФункции // ПолучитьТекстЗапросаОстатков()

// Текст запроса должен быть добавлен к запросу, в котором существует ТаблицаНоменклатуры с полями Номенклатура, Характеристика, Склад
// Если не передан чек УстановитьВручнуюТаблицуНоменклатуры, она будет создана согласно классификации и размещения по ячейкам
//
// Параметры:
//		НазваниеТаблицыОтстатков 					- Строка - название временной таблицы, в которую будут помещены остатки
//		УстановитьВручнуюТаблицуНоменклатуры		- Булево - признак того, что таблица Номенклатуры "ТаблицаНоменклатуры" уже задана в запросе, к которому добавляется текст
//		КонецПериода								- Строка в виде "yyyy,MM,dd,HH,mm,ss". Если не заполнено, будет взята Текущая дата
//
// Возвращаемое значение:
//		Строка   - Текст запроса фактических остатков, выбранных во временную таблицу остатков с названием по умолчанию ЗапасыИПотребности с полями:
// 			- Номенклатура,
//			- Характеристика,
// 			- Склад,
// 			- Ячейка, (опционально)
// 			- Класс, (опционально)
// 			- Назначение,
// 			- ВНаличии,
// 			- ВРезерве,
// 			- Доступно,
//			- РезервироватьПоМереПоступления,
//			- КОбеспечению,
//			- НеОбеспечивать
//
Функция ПолучитьТекстЗапросаОстатковНаДату(
	НазваниеТаблицыОтстатков = "ЗапасыИПотребности",
	УстановитьВручнуюТаблицуНоменклатуры = Ложь,
	КонецПериода = Неопределено,
	СКлассамиИЯчейками = Истина) Экспорт
	
	КонецПериода = ?(ЗначениеЗаполнено(КонецПериода), КонецПериода, Формат(ТекущаяДата(), "ДФ=yyyy,MM,dd,HH,mm,ss"));
	//КонецПериода = ?(ЗначениеЗаполнено(КонецПериода), КонецПериода, "3999, 01, 01, 00, 00, 00");
	
	Если СКлассамиИЯчейками Тогда
		ТекстТаблицаНоменклатуры = "ВЫБРАТЬ
           |	тНоменклатура.Ссылка КАК Номенклатура,
           |	ХарактеристикиНоменклатуры.Ссылка КАК Характеристика,
           |	ABCКлассификацияНоменклатуры_АльтерраСрезПоследних.Подразделение КАК Подразделение,
           |	ABCКлассификацияНоменклатуры_АльтерраСрезПоследних.Класс КАК Класс
           |ПОМЕСТИТЬ ВТ_Класс
           |ИЗ
           |	Справочник.Номенклатура КАК тНоменклатура
           |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ABCКлассификацияНоменклатуры_Альтерра.СрезПоследних({&КонецПериода_},) КАК ABCКлассификацияНоменклатуры_АльтерраСрезПоследних
           |		ПО тНоменклатура.Ссылка = ABCКлассификацияНоменклатуры_АльтерраСрезПоследних.Номенклатура
           |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
           |		ПО (тНоменклатура.Ссылка = ХарактеристикиНоменклатуры.Владелец)
           |;
           |
           |////////////////////////////////////////////////////////////////////////////////
           |ВЫБРАТЬ
           |	ВТ_Класс.Номенклатура КАК Номенклатура,
           |	ВТ_Класс.Характеристика КАК Характеристика,
           |	РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад КАК Склад,
           |	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка КАК Ячейка,
           |	ВТ_Класс.Класс КАК Класс
		   |ПОМЕСТИТЬ ТаблицаНоменклатуры
           |ИЗ
           |	ВТ_Класс КАК ВТ_Класс
           |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
           |		ПО ВТ_Класс.Номенклатура = РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура
           |			И ВТ_Класс.Подразделение = РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад.Подразделение
		   |" + ОбщегоНазначенияУТ.РазделительЗапросовВПакете()
			+ "// Временная таблица отбора остатков: &НазваниеТаблицыОтстатков.
			|";
	Иначе
		ТекстТаблицаНоменклатуры = "ВЫБРАТЬ
           |	тНоменклатура.Ссылка КАК Номенклатура,
           |	ХарактеристикиНоменклатуры.Ссылка КАК Характеристика,
           |	РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад КАК Склад
		   |ПОМЕСТИТЬ ТаблицаНоменклатуры
           |ИЗ
           |	Справочник.Номенклатура КАК тНоменклатура
           |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
           |		ПО (тНоменклатура.Ссылка = ХарактеристикиНоменклатуры.Владелец)
           |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
           |		ПО тНоменклатура.Ссылка = РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура
		   |" + ОбщегоНазначенияУТ.РазделительЗапросовВПакете()
			+ "// Временная таблица отбора остатков: &НазваниеТаблицыОтстатков.
			|";
	КонецЕсли;
									
	
	НачалоЗапроса = ?(Не УстановитьВручнуюТаблицуНоменклатуры, ТекстТаблицаНоменклатуры, "// Временная таблица отбора остатков: " + НазваниеТаблицыОтстатков + ".
	|");
	
		
		Текст =		
			"ВЫБРАТЬ
			|	ЗапасыИПотребности.Номенклатура КАК Номенклатура,
			|	ЗапасыИПотребности.Характеристика КАК Характеристика,
			|	ЗапасыИПотребности.Склад КАК Склад,
			|	ЗапасыИПотребности.Назначение КАК Назначение,
			|	-ЗапасыИПотребности.ВНаличии КАК ВНаличии,
			|	-ЗапасыИПотребности.РезервироватьНаСкладе КАК ВРезерве,
			|	-ЗапасыИПотребности.РезервироватьПоМереПоступления КАК РезервироватьПоМереПоступления,
			|	-ЗапасыИПотребности.КОбеспечению КАК КОбеспечению,
			|	-ЗапасыИПотребности.НеОбеспечивать КАК НеОбеспечивать
			|ПОМЕСТИТЬ ВТ_Набор
			|ИЗ
			|	РегистрНакопления.ЗапасыИПотребности КАК ЗапасыИПотребности
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
			|		ПО ЗапасыИПотребности.Номенклатура = ТаблицаНоменклатуры.Номенклатура
			|ГДЕ
			|	ЗапасыИПотребности.Период <= &КонецПериода_
			|	И ЗапасыИПотребности.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ЗапасыИПотребности.Номенклатура,
			|	ЗапасыИПотребности.Характеристика,
			|	ЗапасыИПотребности.Склад,
			|	ЗапасыИПотребности.Назначение,
			|	ЗапасыИПотребности.ВНаличии,
			|	ЗапасыИПотребности.РезервироватьНаСкладе,
			|	ЗапасыИПотребности.РезервироватьПоМереПоступления,
			|	ЗапасыИПотребности.КОбеспечению,
			|	ЗапасыИПотребности.НеОбеспечивать
			|ИЗ
			|	РегистрНакопления.ЗапасыИПотребности КАК ЗапасыИПотребности
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
			|		ПО ЗапасыИПотребности.Номенклатура = ТаблицаНоменклатуры.Номенклатура
			|ГДЕ
			|	ЗапасыИПотребности.Период <= &КонецПериода_
			|	И ЗапасыИПотребности.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_Набор.Номенклатура КАК Номенклатура,
			|	ВТ_Набор.Характеристика КАК Характеристика,
			|	ВТ_Набор.Склад КАК Склад,
			|	ВТ_Набор.Назначение КАК Назначение,
			|	СУММА(ВТ_Набор.ВНаличии) КАК ВНаличии,
			|	СУММА(ВТ_Набор.ВРезерве) КАК ВРезерве,
			|	СУММА(ВТ_Набор.ВНаличии - ВТ_Набор.ВРезерве) КАК Доступно,
			|	СУММА(ВТ_Набор.РезервироватьПоМереПоступления) КАК РезервироватьПоМереПоступления,
			|	СУММА(ВТ_Набор.КОбеспечению) КАК КОбеспечению,
			|	СУММА(ВТ_Набор.НеОбеспечивать) КАК НеОбеспечивать
			|ПОМЕСТИТЬ ВТ_ТаблицаОтстатков
			|ИЗ
			|	ВТ_Набор КАК ВТ_Набор
			|
			|СГРУППИРОВАТЬ ПО
			|	ВТ_Набор.Номенклатура,
			|	ВТ_Набор.Характеристика,
			|	ВТ_Набор.Склад,
			|	ВТ_Набор.Назначение";
		
	
	Если СКлассамиИЯчейками Тогда
		Текст = Текст + ОбщегоНазначенияУТ.РазделительЗапросовВПакете() + "ВЫБРАТЬ
			|	ВТ_ТаблицаОтстатков.Номенклатура КАК Номенклатура,
			|	ВТ_ТаблицаОтстатков.Характеристика КАК Характеристика,
			|	ВТ_ТаблицаОтстатков.Склад КАК Склад,
			|	ТаблицаНоменклатуры.Ячейка КАК Ячейка,
			|	ТаблицаНоменклатуры.Класс КАК Класс,
			|	ВТ_ТаблицаОтстатков.Назначение КАК Назначение,
			|	ВТ_ТаблицаОтстатков.ВНаличии КАК ВНаличии,
			|	ВТ_ТаблицаОтстатков.ВРезерве КАК ВРезерве,
			|	ВТ_ТаблицаОтстатков.Доступно КАК Доступно,
			|	ВТ_ТаблицаОтстатков.Доступно КАК РезервироватьПоМереПоступления,
			|	ВТ_ТаблицаОтстатков.Доступно КАК КОбеспечению,
			|	ВТ_ТаблицаОтстатков.Доступно КАК НеОбеспечивать
			|ПОМЕСТИТЬ &НазваниеТаблицыОтстатков
			|ИЗ
			|	ВТ_ТаблицаОтстатков КАК ВТ_ТаблицаОтстатков
			|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
			|		ПО ВТ_ТаблицаОтстатков.Номенклатура = ТаблицаНоменклатуры.Номенклатура
			|			И ВТ_ТаблицаОтстатков.Характеристика = ТаблицаНоменклатуры.Характеристика
			|			И ВТ_ТаблицаОтстатков.Склад = ТаблицаНоменклатуры.Склад
			|";
	Иначе
		Текст = Текст + ОбщегоНазначенияУТ.РазделительЗапросовВПакете() + "ВЫБРАТЬ *
			|ПОМЕСТИТЬ &НазваниеТаблицыОтстатков
			|ИЗ
			|	ВТ_ТаблицаОтстатков КАК ВТ_ТаблицаОтстатков
			|";
	КонецЕсли;
		
	ОкончаниеЗапроса = "ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура, Характеристика, Склад, Назначение";
	
	Текст = НачалоЗапроса + Текст + ОкончаниеЗапроса + ОбщегоНазначенияУТ.РазделительЗапросовВПакете();
	                                                                                
	Текст = СтрЗаменить(Текст, "&КонецПериода_", "ДАТАВРЕМЯ(" + КонецПериода + ")");

	Текст = СтрЗаменить(Текст, "&НазваниеТаблицыОтстатков", НазваниеТаблицыОтстатков);
	
	Возврат Текст;

КонецФункции // ПолучитьТекстЗапросаОстатковНаДату()

 #КонецЕсли
